Revit 2027 API
BendingDetailCustomFieldProperties.SegmentLengthsForArcsDisplayOption Property
 Identifies if the arc segment lengths are represented using dimensions or just as text. Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption { get; set; }
Public Property SegmentLengthsForArcsDisplayOption As BendingDetailSegmentLengthsDisplayOptions
	Get
	Set
public:
property BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption {
	BendingDetailSegmentLengthsDisplayOptions get ();
	void set (BendingDetailSegmentLengthsDisplayOptions value);
}
member SegmentLengthsForArcsDisplayOption : BendingDetailSegmentLengthsDisplayOptions with get, set
Property Value
BendingDetailSegmentLengthsDisplayOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace